PANDAS 13

#13: Konversi nilai numerik ke dalam kategori pada data frame

In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [6]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    60
1    98
2    31
3    77
4    36
5     3
6    58
7    24
8    95
9    59

Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut():

In [7]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    60        dewasa
1    98        manula
2    31        dewasa
3    77        manula
4    36        dewasa
5     3          anak
6    58        dewasa
7    24        dewasa
8    95        manula
9    59        dewasa

PANDAS 14

#14: Menggabungkan dua Pandas data frame

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  16  16   3  11   2
1   6   6  13   7   8
2  15  12  16   1   5
3  13  15  19   5   5
4   6  10  16  15  17

In [9]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D  E
0  16  16   3  11  2
2  15  12  16   1  5
3  13  15  19   5  5

In [10]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1   6   6  13   7   8
2  15  12  16   1   5
4   6  10  16  15  17

Menggabungkan dua data frame:

In [11]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A   B   C  D  E
0  15  12  16  1  5

In [12]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   6   6  13   7   8
1   6  10  16  15  17
2  13  15  19   5   5
3  15  12  16   1   5
4  16  16   3  11   2

PANDAS 15

#15: Memecah nilai string suatu kolom ke dalam beberapa kolom baru pada Pandas data frame

In [14]:
data = {'nama':['Shanen Natasha', 'Wallace Quincy', 'Mbah Surip'], 
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

             nama        tempat_kelahiran
0  Shanen Natasha  Surakarta, Jawa Tengah
1  Wallace Quincy    Jakarta, DKI Jakarta
2      Mbah Surip   Mojokerto, Jawa Timur

Memecah nama depan dan nama belakang:

In [15]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

             nama        tempat_kelahiran nama_depan nama_belakang
0  Shanen Natasha  Surakarta, Jawa Tengah     Shanen       Natasha
1  Wallace Quincy    Jakarta, DKI Jakarta    Wallace        Quincy
2      Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

Memecah nama kota dan provinsi:

In [16]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Shanen Natasha,"Surakarta, Jawa Tengah",Shanen,Natasha,Surakarta,Jawa Tengah
1,Wallace Quincy,"Jakarta, DKI Jakarta",Wallace,Quincy,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

PANDAS 16

#16: Menata ulang data frame dengan multiple indexes menggunakan unstack

In [18]:
df = pd.read_csv('titanicfull.csv')
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,1,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [20]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')

Data frame dengan multiple indexes dari hasil groupping:

In [27]:
df.groupby(['sex', 'pclass'])['survival_status'].mean()

sex     pclass
female  1         0.666667
male    1         1.000000
Name: survival_status, dtype: float64

Menata ulang data frame dengan mutiple indexes:

In [28]:
df.groupby(['sex', 'pclass'])['survival_status'].mean().unstack()

pclass         1
sex
female  0.666667
male    1.000000